# IntersectionResult Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IntersectionResult Members
IntersectionResult Class Constructors Methods Properties See Also
---
The IntersectionResult type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IntersectionResult | Initializes a new instance of the IntersectionResult class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Distance | Distance from the original object to located point. |
| EdgeObject | Edge of the face close to the point of intersection. |
| EdgeParameter | Parameter of a point on the edge closest to the point of intersection. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| Parameter | 1d parameter of the point of intersection. |
| UVPoint | 2d (or two 1d) parameters of the point of intersection. |
| XYZPoint | Point of intersection in local 3d coordinates. |

# See Also
IntersectionResult Class
Autodesk.Revit.DB Namespace